[
    {
        "foreclosure_number": 1,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "12965 17 Mile Rd NE",
        "name": "Name: Melanie Kurylowicz ",
        "description": "Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM on APRIL 2, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the conditions of a mortgage made by Melanie Kurylowicz, a single woman, to Mortgage Electronic Registration Systems, Inc., as nominee for Van Dyk Mortgage Corporation., Mortgagee, dated June 9, 2020 and recorded June 22, 2020 in Instrument Number 202006220053202 and Affidavit Affecting Realty recorded on February 24, 2025, in Instrument Number 202502240009631, Kent County Records, Michigan. Said mortgage is now held by Carrington Mortgage Services, LLC, by assignment. There is claimed to be due at the date hereof the sum of One Hundred Seventy Thousand Five Hundred and 54/100 Dollars ($170,500.54). Under the power of sale contained in said mortgage and the statute in such case made and provided, notice is hereby given that said mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at public venue at the place of holding the circuit court within Kent County, Michigan at 10:00 AM on APRIL 2, 2025. Said premises are located in the Township of Spencer, Kent County Michigan, and are described as: A PARCEL OF LAND 209 FEET EAST AND WEST BY 418 FEET NORTH AND SOUTH IN THE SOUTHWEST CORNER OF THE EAST 1/4 OF THE SOUTHWEST 1/4 OF THE SOUTHWEST 1/4 SECTION 26, T10N, R9W, SPENCER TOWNSHIP, KENT COUNTY, MICHIGAN. 12965 17 Mile Rd NE, Gowen, Michigan 49326 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCLA §600.3241a, in which case the redemption period shall be 30 days from the date of such sale. If the property is sold at foreclosure sale, pursuant to MCL 600.3278, the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damage to the property during the redemption period. Dated: March 5, 2025 File No. 25-000893 Firm Name: Orlans Law Group PLLC Firm Address: 1650 West Big Beaver Road, Troy MI 48084 Firm Phone Number: (248) 502.1400 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293392"
    },
    {
        "foreclosure_number": 2,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "84 W Division St",
        "name": "Name: Kimberly Darko ",
        "description": "Notice of Foreclosure by Advertisement Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 2, 2025. The amount due on the mortgage may be greater on the day of sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information: Name(s) of the mortgagor(s): Kimberly Joy Darko, a single woman Original Mortgagee: Mortgage Electronic Registration Systems, Inc., as mortgagee, as nominee for lender and lender's successors and/or assigns Foreclosing Assignee (if any): TH MSR Holdings LLC f/k/a Matrix Financial Services Corporation Date of Mortgage: August 26, 2021 Date of Mortgage Recording: September 9, 2021 Amount claimed due on date of notice: $164,233.51 Description of the mortgaged premises: Situated in Village of Sparta, Kent County, Michigan, and described as: All of Lot 6, and the East 9 feet of Lot 7, Block 1, Hinman's Addition to the Village of Sparta, Kent County, Michigan, as recorded in Liber 4 of Plats, Page 16. Common street address (if any): 84 W Division St, Sparta, MI 49345-1012 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCL 600.3241a; or, if the subject real property is used for agricultural purposes as defined by MCL 600.3240(16). If the property is sold at foreclosure sale under Chapter 32 of the Revised Judicature Act of 1961, pursuant to MCL 600.3278 the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. This notice is from a debt collector. Date of notice: March 5, 2025 Trott Law, P.C. 31440 Northwestern Hwy, Suite 145 Farmington Hills, MI 48334 (248) 642-2515   1554682 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293391"
    },
    {
        "foreclosure_number": 3,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "1435 Ball Ave NE",
        "name": "Name: Donald D. Gould ",
        "description": "Notice of Foreclosure by Advertisement Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 2, 2025.  The amount due on the mortgage may be greater on the day of sale.  Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property.  A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information: Name(s) of the mortgagor(s):     Donald D. Gould and Janice A. Gould Original Mortgagee:              Mortgage Electronic Registration Systems, Inc., as mortgagee, as nominee for lender and lender's successors and/or assigns Foreclosing Assignee (if any):   Citibank, N.A., as trustee for CMLTI Asset Trust Date of Mortgage:                February 7, 2007 Date of Mortgage Recording:      February 16, 2007 Amount claimed due on date of notice: $110,653.80 Description of the mortgaged premises: Situated in City of Grand Rapids, Kent County, Michigan, and described as: Lot 17, except the North 45 feet, all of Lot 18 and the North 23 feet of Lot 19, Block 9 of Lane and Walsh's East Leonard Heights Subdivision, as recorded in Liber 29 of Plats, Page 15, Kent County Records Common street address (if any): 1435 Ball Ave NE, Grand Rapids, MI 49505-5613 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCL 600.3241a; or, if the subject real property is used for agricultural purposes as defined by MCL 600.3240(16). If the property is sold at foreclosure sale under Chapter 32 of the Revised Judicature Act of 1961, pursuant to MCL 600.3278 the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. This notice is from a debt collector. Date of notice: March 5, 2025 Trott Law, P.C. 31440 Northwestern Hwy, Suite 145 Farmington Hills, MI  48334 (248) 642-2515 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293390"
    },
    {
        "foreclosure_number": 4,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "185 36th St SE Unit 11",
        "name": "Name: Kona A. Sesay ",
        "description": "Notice of Foreclosure by Advertisement Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 2, 2025.  The amount due on the mortgage may be greater on the day of sale.  Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property.  A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information: Name(s) of the mortgagor(s):     Kona A. Sesay, unmarried woman Original Mortgagee:              Old National Bank Foreclosing Assignee (if any):   None Date of Mortgage:                April 30, 2024 Date of Mortgage Recording:      May 3, 2024 Amount claimed due on date of notice: $149,487.12 Description of the mortgaged premises: Situated in City of Wyoming, Kent County, Michigan, and described as: Unit 11 Godwin Heights Townhomes Condominium, a Condominium according to the Master Deed recorded in Instrument No. 202101150005364, Kent County Records, and designated as Kent County Condominium Subdivision Plan No. 1125, and amendments thereto, if any, together with rights in general common elements and limited common elements as set forth in the Master Deed and as described in Act 59 of the Public Acts of 1978, as amended. Common street address (if any): 185 36th St SE Unit 11, Wyoming, MI 49548-2203 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCL 600.3241a; or, if the subject real property is used for agricultural purposes as defined by MCL 600.3240(16). If the property is sold at foreclosure sale under Chapter 32 of the Revised Judicature Act of 1961, pursuant to MCL 600.3278 the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. This notice is from a debt collector. Date of notice: March 5, 2025 Trott Law, P.C. 31440 Northwestern Hwy, Suite 145 Farmington Hills, MI  48334 (248) 642-2515 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293389"
    },
    {
        "foreclosure_number": 5,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 23, 2025",
        "address": "9298 Stone View Dr NE",
        "name": "Name: Jason A Grostick ",
        "description": "Notice of Foreclosure by Advertisement Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM on 4/23/2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Names of Mortgagor(s): Jason A. Grostick and Kerrie Grostick. Original mortgagee: Mortgage Electronic Registration Systems, Inc., as mortgagee, as nominee for Lakeview Loan Servicing, LLC. Date of mortgage: 8/25/2021. Mortgage recorded on 8/31/2021 as Document No. 202108310096204. Foreclosing Assignee (if any): Lakeview Loan Servicing, LLC. Amount claimed to be due at the date hereof: $183,045.70 Mortgaged premises: Situated in Kent County, and described as: LAND SITUATED IN THE COUNTY OF KENT, STATE OF MICHIGAN, DESCRIBED AS: UNIT 36, STONE CREST SITE CONDOMINIUM, A SITE CONDOMINIUM ACCORDING TO THE MASTER DEED RECORDED IN INSTRUMENT NO. 20030827-0171757 AND FIRST AMENDMENT TO MASTER DEED RECORDED IN INSTRUMENT NO. 200301007-0201697 IN THE OFFICE OF THE KENT COUNTY REGISTER OF DEEDS, AND DESIGNATED AS KENT COUNTY CONDOMINIUM SUBDIVISION PLAN NO. 632, TOGETHER WITH RIGHTS IN GENERAL COMMON ELEMENTS AND LIMITED COMMON ELEMENTS AS SET FORTH IN SAID MASTER DEED AND AS DESCRIBED IN ACT 59 OF THE PUBLIC ACTS OF 1978 AS AMENDED. Commonly known as 9298 Stone View Dr NE, Rockford, MI 49341. The redemption period will be 6 months from the date of such sale, unless the property is abandoned or used for agricultural purposes. If the property is determined abandoned under MCL 600.3241a, the redemption period will be 30 days from the date of such sale, or 15 days after the statutory notice, whichever is later. If the property is determined abandoned under MCL 600.3241, the redemption period will be 1 month from the date of such sale. If the property is presumed to be used for agricultural purposes pursuant to MCL 600.3240(16), the redemption period is 1 year from the date of such sale. The redemption period may be extinguished pursuant to MCL 600.3238. If the above referenced property is sold at a foreclosure sale under Chapter 32 of Act 236 of 1961, under MCL 600.3278, the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Date of Notice: 03/05/2025. Codilis & Moody, P.C. 15W030 North Frontage Road, Suite 100 Burr Ridge, IL 60527 (313) 536-2500. This law firm is a debt collector. C&M File 23-25-00061 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293388"
    },
    {
        "foreclosure_number": 6,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 23, 2025",
        "address": "210 E Main St",
        "name": "Name: Randy Ward ",
        "description": "Notice of Foreclosure by Advertisement Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 23, 2025. The amount due on the mortgage may be greater on the day of sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information: Name(s) of the mortgagor(s): Randy Patrick Ward and Amanda Dash Original Mortgagee: Mortgage Electronic Registration Systems, Inc., as mortgagee, as nominee for lender and lender's successors and/or assigns Foreclosing Assignee (if any): Freedom Mortgage Corporation Date of Mortgage: March 7, 2023 Date of Mortgage Recording: March 9, 2023 Amount claimed due on date of notice: $379,943.63 Description of the mortgaged premises: Situated in City of Rockford, Kent County, Michigan, and described as: Commencing at the Northeast corner of the Southwest 1/4 of the Northeast 1/4 of Section 36, Town 9 North, Range 11 West; thence South 33 feet to the place of beginning; thence South 160 feet; thence West 106 feet; thence North to the South line of the highway; thence Easterly along the South line of said highway 106 feet to the Place of Beginning. Common street address (if any): 210 E Main St, Rockford, MI 49341-1069 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCL 600.3241a; or, if the subject real property is used for agricultural purposes as defined by MCL 600.3240(16). If the property is sold at foreclosure sale under Chapter 32 of the Revised Judicature Act of 1961, pursuant to MCL 600.3278 the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. This notice is from a debt collector. Date of notice: March 5, 2025 Trott Law, P.C. 31440 Northwestern Hwy, Suite 145 Farmington Hills, MI 48334 (248) 642-2515   1554705 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293387"
    },
    {
        "foreclosure_number": 7,
        "published_dates": "First Published: March 05, 2025 Last Published: April 02, 2025 Published Sale Date: April 09, 2025",
        "address": "84 W. Division Street",
        "name": "Name: Kimberly Joy Darko ",
        "description": "Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. NOTICE OF MORTGAGE FORECLOSURE SALE Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 a.m. on April 9, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the terms and conditions of a Mortgage made by Kimberly Joy Darko, an unmarried woman, as Mortgagor, to Frankenmuth Credit Union, as Mortgagee, dated August 18, 2022, recorded August 24, 2022 as Instrument No. 202208240067111 of Kent County, Michigan records (the “Mortgage”). The amount claimed to be due and owing on the Mortgage is Forty Three Thousand Four Hundred Four and 95/100 Dollars ($43,404.95) on the date of this Notice. The Mortgage contains a power of sale and no suit or proceeding at law or in equity has been instituted to recover the debt secured by the Mortgage, or any part of the Mortgage. Under the power of sale contained in said Mortgage, and the statute in such case made and provided, take notice that on April 9, 2025 at 10:00 a.m., local time, or any adjourned date thereafter, the Mortgage will be foreclosed by sale of the mortgaged premises, or some part of them, at public auction, to the highest bidder, at the place of holding the Circuit Court within Kent County, Michigan. The Mortgagee will apply the sale proceeds to the debt secured by the Mortgage as stated above, plus interest accruing on the amount due at a rate of 7.00% per annum, costs and expenses of the Mortgagee as provided for in the Mortgage, and any amounts subsequently paid by the Mortgagee to protect its interest in the property. The property to be sold at foreclosure is all of the real estate and improvements located in the Township of Sparta, County of Kent and State of Michigan, more particularly described as follows: Lot 6 and the East 9 feet of Lot 7, Block 1, Hinman's Addition, according to the recorded plat thereof, as recorded in Liber 4 of Plats, Page 16. Parcel ID No(s): 41-05-22-227-006 Commonly known as: 84 W. Division Street, Sparta, MI 49417 The redemption period shall be six (6) months from the date of sale, unless determined to be abandoned in accordance with MCL 600.3241a, in which case the redemption period shall be 30 days from the date of such sale. Pursuant to MCL 600.3278, the Mortgagor will be held responsible to the person who buys the property at the foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention Purchasers: This sale may be rescinded by the foreclosing mortgagee for any reason. In that event, your damages, if any, shall be limited solely to the return of the bid amount tendered at sale, plus interest, and the purchaser shall have no further recourse against the Mortgagor, the Mortgagee, or the Mortgagee's attorneys. Dated: February 26, 2025 STANCATO TRAGGE WELLS, PLLC Frankenmuth Credit Union, Mortgagee Attorneys for Mortgagee By: John P. Tragge 2111 Woodward Avenue Suite 701 Detroit, Michigan 48201 (248) 731-4500 (03-05)(04-02)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293381"
    },
    {
        "foreclosure_number": 8,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "2170 Brook Ct SE",
        "name": "Name: Arik Michael Hoppe ",
        "description": "Notice of Foreclosure by Advertisement Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 2, 2025. The amount due on the mortgage may be greater on the day of sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information: Name(s) of the mortgagor(s): Arik Michael Hoppe and Briana Nicole Hoppe Original Mortgagee: Mortgage Electronic Registration Systems, Inc., as nominee for lender and lender's successors and/or assigns Foreclosing Assignee (if any): Lakeview Loan Servicing, LLC Date of Mortgage: March 30, 2023 Date of Mortgage Recording: April 5, 2023 Amount claimed due on date of notice: $330,707.39 Description of the mortgaged premises: Situated in City of Grand Rapids, Kent County, Michigan, and described as: Lot 36, Brook Trails No. 2, according to the recorded plat thereof, as recorded in Liber 85 of Plats, Page 19, Kent County Records. Common street address (if any): 2170 Brook Ct SE, Grand Rapids, MI 49508-2679 The redemption period shall be 6 months from the date of such sale, unless determined abandoned in accordance with MCL 600.3241a; or, if the subject real property is used for agricultural purposes as defined by MCL 600.3240(16). If the property is sold at foreclosure sale under Chapter 32 of the Revised Judicature Act of 1961, pursuant to MCL 600.3278 the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. This notice is from a debt collector. Date of notice: March 5, 2025 Trott Law, P.C. 31440 Northwestern Hwy, Suite 145 Farmington Hills, MI 48334 (248) 642-2515   1554759 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293379"
    },
    {
        "foreclosure_number": 9,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "919 Griggs St SE",
        "name": "Name: Guadalape Guillen II ",
        "description": "SHORT FORECLOSURE NOTICE - KENT COUNTY Notice of Foreclosure by Advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, on April 02, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. MORTGAGE: Mortgagor(s): Guadalape Guillen II, a single man and Rose Guillen, a single woman Original Mortgagee: ABN AMRO Mortgage Group, Inc. Date of mortgage: November 12, 2002 Recorded on December 3, 2002, Liber 6450, on Page 1291, Foreclosing Assignee (if any): Federal Home Loan Mortgage Corporation as Trustee for Freddie Mac Seasoned Credit Risk Transfer Trust, Series 2019-1 Amount claimed to be due at the date hereof: S ixty-Eight Thousand Seventy-One and 94/100 Dollars ($68,071.94) Mortgaged premises: Situated in Kent County, and described as: Lot 8, Adelaid Plat, as recorded in Liber 33 of Plats, Page 4, Kent County Records. Commonly known as 919 Griggs St SE, Grand Rapids, MI 49507 The redemption period will be 6 month from the date of such sale, unless abandoned under MCL 600.3241a, in which case the redemption period will be 30 days from the date of such sale, or 15 days from the MCL 600.3241a(b) notice, whichever is later; or unless extinguished pursuant to MCL 600.3238. If the above referenced property is sold at a foreclosure sale under Chapter 32 of Act 236 of 1961, under MCL 600.3278, the borrower will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Federal Home Loan Mortgage Corporation as Trustee for Freddie Mac Seasoned Credit Risk Transfer Trust, Series 2019-1 Mortgagee/Assignee Schneiderman & Sherman P.C. 23938 Research Dr, Suite 300 Farmington Hills, MI 48335 248.539.7400   1554972 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293360"
    },
    {
        "foreclosure_number": 10,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "2847 DAVENTRY CT SE",
        "name": "Name: Sally Gordon ",
        "description": "FORECLOSURE NOTICE Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, April 2, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the conditions of a certain mortgage made by Sally Gordon aka Sally Ann Gordon, Unmarried Woman to Fifth Third Bank, National Association, Mortgagee, dated August 2, 2021, and recorded on August 17, 2021, as Document Number: 202108170091207, Kent County Records, , on which mortgage there is claimed to be due at the date hereof the sum of One Hundred Thousand Seven Hundred Seventy-Five and 57/100 ($100,775.57) including interest at the rate of 3.12500% per annum. Said premises are situated in the City of Kentwood, Kent County, Michigan, and are described as: Lot 145, of Hampton Meadows Number 2, part of the Southeast 1/4 and Southwest 1/4, Section 15, Town 6 North, Range 11 West, City of Kentwood, Kent County, Michigan, as recorded in Liber 112, Page 26 of Plats, Kent County Records. Commonly known as: 2847 DAVENTRY CT SE, KENTWOOD, MI 49512 If the property is eventually sold at foreclosure sale, the redemption period will be 6.00 months from the date of sale unless the property is abandoned or used for agricultural purposes. If the property is determined abandoned in accordance with MCL 600.3241 and/or 600.3241a, the redemption period will be 30 days from the date of sale, or 15 days after statutory notice, whichever is later. If the property is presumed to be used for agricultural purposes prior to the date of the foreclosure sale pursuant to MCL 600.3240, the redemption period is 1 year. Pursuant to MCL 600.3278, if the property is sold at a foreclosure sale, the borrower(s) will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. TO ALL PURCHASERS: The foreclosing mortgagee can rescind the sale. In that event, your damages are, if any, limited solely to the return of the bid amount tendered at sale, plus interest. Dated: March 5, 2025 Randall S. Miller & Associates, P.C. Attorneys for Fifth Third Bank N.A. 43252 Woodward Avenue, Suite 180, Bloomfield Hills, MI 48302, (248) 335-9200 Hours: 9:00 a.m. - 5:00 p.m. Case No. 25MI00145-1 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293354"
    },
    {
        "foreclosure_number": 11,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "4663 BLAINE AVE SE",
        "name": "Name: Biak Thang ",
        "description": "FORECLOSURE NOTICE Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, April 2, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the conditions of a certain mortgage made by Biak Thang and Mery Cung, Husband and Wife to Fifth Third Bank, National Association, Mortgagee, dated March 30, 2021, and recorded on April 12, 2021, as Document Number: 202104120042887, Kent County Records, , on which mortgage there is claimed to be due at the date hereof the sum of One Hundred Sixty-Seven Thousand Eighteen and 40/100 ($167,018.40) including interest at the rate of 2.62500% per annum. Said premises are situated in the City of Kentwood, Kent County, Michigan, and are described as: Lot number Eighty-Five (85) of Eastern Heights No. 2, Section 29, Town 6 North, Range 11 West, Paris Township (Now City of Kentwood), Kent County, Michigan, according to the recorded Plat thereof, as recorded in Liber 52 of Plats, Page 46, Kent County Records. Commonly known as: 4663 BLAINE AVE SE, KENTWOOD, MI 49508 If the property is eventually sold at foreclosure sale, the redemption period will be 6.00 months from the date of sale unless the property is abandoned or used for agricultural purposes. If the property is determined abandoned in accordance with MCL 600.3241 and/or 600.3241a, the redemption period will be 30 days from the date of sale, or 15 days after statutory notice, whichever is later. If the property is presumed to be used for agricultural purposes prior to the date of the foreclosure sale pursuant to MCL 600.3240, the redemption period is 1 year. Pursuant to MCL 600.3278, if the property is sold at a foreclosure sale, the borrower(s) will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. TO ALL PURCHASERS: The foreclosing mortgagee can rescind the sale. In that event, your damages are, if any, limited solely to the return of the bid amount tendered at sale, plus interest. Dated: March 5, 2025 Randall S. Miller & Associates, P.C. Attorneys for Fifth Third Bank, National Association 43252 Woodward Avenue, Suite 180, Bloomfield Hills, MI 48302, (248) 335-9200 Hours: 9:00 a.m. - 5:00 p.m. Case No. 25MI00075-1 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293353"
    },
    {
        "foreclosure_number": 12,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "1945 CAMILLE DR SE",
        "name": "Name: Bridgett Johnson-Holt ",
        "description": "FORECLOSURE NOTICE Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, April 2, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the conditions of a certain mortgage made by Bridgett Johnson-Holt and Victor J Holt, Wife and Husband to Fifth Third Bank, National Association, FKA Fifth Third Bank as successor by merger to Fifth Third Mortgage Company, Mortgagee, dated October 26, 2018, and recorded on November 2, 2018, as Document Number: 20181102-0086759, Kent County Records, , on which mortgage there is claimed to be due at the date hereof the sum of Two Hundred Fifty-Five Thousand Five Hundred Sixty-Three and 42/100 ($255,563.42) including interest at the rate of 5.25000% per annum. Said premises are situated in the City of Kentwood, Kent County, Michigan, and are described as: Lot 37, College Heights No. 2, City of Kentwood, Kent County, Michigan, according to the recorded Plat in Liber 71 of Plats, Page 12, Kent County Records. Commonly known as: 1945 CAMILLE DR SE, KENTWOOD, MI 49546 If the property is eventually sold at foreclosure sale, the redemption period will be 6.00 months from the date of sale unless the property is abandoned or used for agricultural purposes. If the property is determined abandoned in accordance with MCL 600.3241 and/or 600.3241a, the redemption period will be 30 days from the date of sale, or 15 days after statutory notice, whichever is later. If the property is presumed to be used for agricultural purposes prior to the date of the foreclosure sale pursuant to MCL 600.3240, the redemption period is 1 year. Pursuant to MCL 600.3278, if the property is sold at a foreclosure sale, the borrower(s) will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. TO ALL PURCHASERS: The foreclosing mortgagee can rescind the sale. In that event, your damages are, if any, limited solely to the return of the bid amount tendered at sale, plus interest. Dated: March 5, 2025 Randall S. Miller & Associates, P.C. Attorneys for Fifth Third Bank, National Association, FKA Fifth Third Bank as successor by merger to Fifth Third Mortgage Company 43252 Woodward Avenue, Suite 180, Bloomfield Hills, MI 48302, (248) 335-9200 Hours: 9:00 a.m. - 5:00 p.m. Case No. 25MI00120-1 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293350"
    },
    {
        "foreclosure_number": 13,
        "published_dates": "First Published: March 05, 2025 Last Published: March 26, 2025 Published Sale Date: April 02, 2025",
        "address": "3335 WAYBURN AVE SW",
        "name": "Name: Allison McKinney ",
        "description": "FORECLOSURE NOTICE Attention homeowner: If you are a military service member on active duty, if your period of active duty has concluded less than 90 days ago, or if you have been ordered to active duty, please contact the attorney for the party foreclosing the mortgage at the telephone number stated in this notice. Notice of foreclosure by advertisement. Notice is given under section 3212 of the revised judicature act of 1961, 1961 PA 236, MCL 600.3212, that the following mortgage will be foreclosed by a sale of the mortgaged premises, or some part of them, at a public auction sale to the highest bidder for cash or cashier's check at the place of holding the circuit court in Kent County, starting promptly at 10:00 AM, April 2, 2025. The amount due on the mortgage may be greater on the day of the sale. Placing the highest bid at the sale does not automatically entitle the purchaser to free and clear ownership of the property. A potential purchaser is encouraged to contact the county register of deeds office or a title insurance company, either of which may charge a fee for this information. Default has been made in the conditions of a certain mortgage made by Allison McKinney, Unmarried Woman to Fifth Third Bank, National Association, Mortgagee, dated September 9, 2022, and recorded on September 13, 2022, as Document Number: 202209130071865, Kent County Records, , on which mortgage there is claimed to be due at the date hereof the sum of Two Hundred Sixty-Four Thousand Two Hundred Thirty-Two and 28/100 ($264,232.28) including interest at the rate of 4.87500% per annum. Said premises are situated in the City of Grandville, Kent County, Michigan, and are described as: The South 1/2 of the North 1/2 of Lot 16, Whalen`s Addition to Hamilton Park, according to the recorded Plat thereof, as recorded in Liber 19 of Plats, Page 16, Kent County Records. Commonly known as: 3335 WAYBURN AVE SW, GRANDVILLE, MI 49418 If the property is eventually sold at foreclosure sale, the redemption period will be 6.00 months from the date of sale unless the property is abandoned or used for agricultural purposes. If the property is determined abandoned in accordance with MCL 600.3241 and/or 600.3241a, the redemption period will be 30 days from the date of sale, or 15 days after statutory notice, whichever is later. If the property is presumed to be used for agricultural purposes prior to the date of the foreclosure sale pursuant to MCL 600.3240, the redemption period is 1 year. Pursuant to MCL 600.3278, if the property is sold at a foreclosure sale, the borrower(s) will be held responsible to the person who buys the property at the mortgage foreclosure sale or to the mortgage holder for damaging the property during the redemption period. TO ALL PURCHASERS: The foreclosing mortgagee can rescind the sale. In that event, your damages are, if any, limited solely to the return of the bid amount tendered at sale, plus interest. Dated: March 5, 2025 Randall S. Miller & Associates, P.C. Attorneys for Fifth Third Bank N.A. 43252 Woodward Avenue, Suite 180, Bloomfield Hills, MI 48302, (248) 335-9200 Hours: 9:00 a.m. - 5:00 p.m. Case No. 25MI00122-1 (03-05)(03-26)",
        "url": "https://legalnews.com/Home/PublicNoticesDetails/1293349"
    }
]